/* 
  Localizable.strings
  CSResourceFork

  Created by Charles Srstka on 2/19/12.
  Copyright (c) 2012 __MyCompanyName__. All rights reserved.
*/







"Yes" = "Sì";
"No" = "No";

"Error" = "Errore";
"Warning" = "Attenzione";

"NOT_RSRC_FILE" = "Il file “%@” non è un file di risorse.";
"UNKNOWN_ERROR" = "Errore sconosciuto";

"FORK_READ_ERROR" = "Errore nella lettura dei dati dal resource fork: %d";
"FORK_WRITE_ERROR" = "Errore nella scrittura dei dati sul resource fork: %d";

"NOT_A_READ_HANDLE" = "Questo file handle non può leggere dati.";
"NOT_A_WRITE_HANDLE" = "Questo file handle non può scrivere dati.";

"RES_TOO_LARGE" = "La dimensione di ‘%@’ ID %d è %lu byte, ma una risorsa non può essere più grande di %lu byte.";
"RES_DATA_TOO_LARGE" = "La somma delle dimensioni delle risorse di questo file di risorse eccede %lu byte, cosa non consentita.";

"TOO_MANY_TYPES" = "Un file di risorse non può contenere più di %lu tipi di risorse.";

"TYPE_LIST_OFFSET_TOO_LARGE" = "L'offset dell'elenco dei tipi di risorsa è %lu, ma il massimo è %lu.";
"NAME_LIST_OFFSET_TOO_LARGE" = "L'offset dell'elenco dei nomi di risorsa è %lu, ma il massimo è %lu.";
"RES_NAME_OFFSET_TOO_LARGE" = "L'offset per il nome della risorsa ‘%@’ ID %d è troppo grande; il massimo è %lu.";
"RES_DATA_OFFSET_TOO_LARGE" = "L'offset per i dati delle risorsa ‘%@’ ID %d è troppo grande; il massimo è %lu.";
"REF_LIST_TOO_LONG" = "La lista di riferimento per il tipo ‘%@’ è troppo lunga; dev'essere più corta di %lu byte.";
"TOO_MANY_RESOURCES" = "Troppe risorse di tipo ‘%@’; il massimo è %lu.";

"INVALID_RESOURCE_TYPE" = "Tipo risorsa ‘%@’ non valido.";
"INVALID_RESOURCE_ID" = "ID risorsa %ld non valido; sono permessi solo i valori da %d a %d.";

"RES_DATA_NOT_FOUND" = "Non posso trovare i dati della risorsa ‘%@’ ID %d.";

"RES_ALREADY_EXISTS" = "Esiste già una risorsa di tipo ‘%@’ e ID %d.";
"RES_NOT_FOUND" = "Tipo risorsa ‘%@’ %d non trovato.";

"FORK_ALREADY_EXISTS" = "Il fork specificato esiste già.";
"FORK_NOT_FOUND" = "Il fork specificato non esiste.";

"XATTR_NOT_FOUND" = "L'attributo esteso “%@” non sembra esistere.";
"XATTR_ALREADY_EXISTS" = "Un attributo esteso con il nome “%@” esiste già.";

"INVALID_HFS_TYPE" = "Type “%@” non valido.";
"INVALID_CREATOR" = "Creator “%@” non valido.";

"DATA_FORK_NOT_SUPPORTED" = "Il file “%@” non supporta il data fork.";
"RSRC_FORK_NOT_SUPPORTED" = "Il file “%@” non supporta il resource fork.";
"XATTRS_NOT_SUPPORTED" = "Il file “%@” non supporta gli attributi estesi.";
"SPECIAL_XATTR_NOT_SUPPORTED" = "Spiacente, l'attributo esteso speciale “%@” non è supportato.";
"SPECIAL_XATTR_CANNOT_BE_RENAMED" = "Spiacente, l'attributo esteso speciale “%@” non può essere rinominato.";

"UID_NOT_FOUND" = "Non esiste alcun utente con ID %lu.";
"USER_NAME_NOT_FOUND" = "Non esiste alcun utente con nome “%@”.";

"GID_NOT_FOUND" = "Non esiste alcun gruppo con ID %lu.";
"GROUP_NAME_NOT_FOUND" = "Non esiste alcun gruppo con nome “%@”.";

// ACL stuff

"User" = "utente";
"Group" = "gruppo";
"Unknown" = "sconosciuto";

"allow" = "permetti";
"deny" = "nega";

"ACL_READ_DATA" = "read";
"ACL_LIST_DIRECTORY" = "list";
"ACL_WRITE_DATA" = "write";
"ACL_ADD_FILE" = "add_file";
"ACL_EXECUTE" = "execute";
"ACL_SEARCH" = "search";
"ACL_DELETE" = "delete";
"ACL_APPEND_DATA" = "append";
"ACL_ADD_SUBDIRECTORY" = "add_subdirectory";
"ACL_DELETE_CHILD" = "delete_child";
"ACL_READ_ATTRIBUTES" = "readattr";
"ACL_WRITE_ATTRIBUTES" = "writeattr";
"ACL_READ_EXTATTRIBUTES" = "readextattr";
"ACL_WRITE_EXTATTRIBUTES" = "writeextattr";
"ACL_READ_SECURITY" = "readsecurity";
"ACL_WRITE_SECURITY" = "writesecurity";
"ACL_CHANGE_OWNER" = "chown";

"ACL_FILE_INHERIT" = "file_inherit";
"ACL_DIRECTORY_INHERIT" = "directory_inherit";
"ACL_LIMIT_INHERIT" = "limit_inherit";
"ACL_ONLY_INHERIT" = "only_inherit";

"ACL_PERM_SEPARATOR" = ", ";